etc/OpenFOAM_Sample_Files/innerflow/system/blockMeshDict
/*--------------------------------*- C++ -*---------------------------------*\
| =========                |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     3.1                                |
|   \  /    A nd           | Web:         http://www.extend-project.de       |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile 

{

version     2.0;

format      ascii;

class       dictionary;

object      blockMeshDict;

}
vertices
(
(	-900	-1130	0	)
(	1120	-1130	0	)
(	1120	870	0	)
(	-900	870	0	)
(	-900	-1130	230	)
(	1120	-1130	230	)
(	1120	870	230	)
(	-900	870	230	)

);


blocks
(
	hex (0 1 2 3 4 5 6 7) 
	(202 200 23)
	simpleGrading (1 1 1)
);


boundary
(
top
    {
		type patch;
		faces
		(
			(4 5 6 7)
		);
    }

bottom
    {
		type patch;
		faces
		(
			(0 3 2 1)
		);
    }

north
    {
		type patch;
		faces
		(
			(3 7 6 2)
		);
    }

south
    {
		type patch;
		faces
		(
			(1 5 4 0)
		);
    }

west
    {
		type patch;
		faces
		(
			(2 6 5 1)
		);
    }

east
    {
		type patch;
		faces
		(
			(0 4 7 3)
		);
    }

);
