etc/OpenFOAM_Sample_Files/innerflow/system/snappyHexMeshDict
/*--------------------------------*- C++ -*---------------------------------*\
| =========                |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     3.1                                |
|   \  /    A nd           | Web:         http://www.extend-project.de       |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile 

{

version     2.0;

format      ascii;

class       dictionary;

object      snappyHexMeshDict;

}


castellatedMesh true;
snap true;
addLayers false;


geometry
{
	innerflow.stl
	{
		type triSurfaceMesh;
		name innerflow;
		regions
		{
			east_window
			{
				name east_window;
			}

			west_window
			{
				name west_window;
			}

			room
			{
				name room;
			}

		}	
	}
}


castellatedMeshControls
{

	maxLocalCells 		50000;				
	maxGlobalCells 		200000;
	minRefinementCells	10;
	maxLoadUnbalance	0.10;
	nCellsBetweenLevels	1;

	features
	(
	);


	refinementSurfaces {
		innerflow
		{
			level (0 0);  // global region value
			regions
			{		
				east_window
				{
					level (4 4);
				}
				
				west_window
				{
					level (4 4);
				}
			
				room
				{
					level (3 3);	
				}

			}
		}
	}

	resolveFeatureAngle	30;

	refinementRegions {
	}
	
	locationInMesh (5 5 1);
	allowFreeStandingZoneFaces false;
}


snapControls
{
	nSmoothPatch			3;
	tolerance				1;
	nSolveIter				300;
	nRelaxIter				5;
	implicitFeatureSnap		true;
	multiRegionFeatureSnap	true;
}


addLayersControls
{
	relativeSizes true;
	layers
	{
	}
	expansionRatio	1.0;
	finalLayerThickness 0.3;
	minThickness	0.2;
	nGrow	0;
	featureAngle	60;
	nRelaxIter	5;
	nSmoothSurfaceNormals	1;
	nSmoothThickness	10;
	nSmoothNormals 3;
	maxFaceThicknessRatio 0.5;
	maxThicknessToMedialRatio	0.3;
	minMedianAxisAngle	130;
	nBufferCellsNoExtrude	0;
	nLayerIter	50;
	nRelaxedIter	20;
}


meshQualityControls
{
	maxNonOrtho 			60;
	maxBoundarySkewness 	20;
	maxInternalSkewness		4; 
	maxConcave				80;
	minFlatness				0.5;
	minVol					1e-13;
	minTetQuality			1e-15;
	minArea					-1;
	minTwist				0.02;
	minDeterminant			0.001;
	minFaceWeight			0.02;
	minVolRatio				0.01;
	minTriangleTwist		-1;
	nSmoothScale			4;
	errorReduction			0.75;
 }

debug	0;

mergeTolerance	1E-6;
