etc/OpenFOAM_Sample_Files/innerflow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    west_window
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2560;
        startFace       127924;
    }
    east_window
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2560;
        startFace       130484;
    }
    room
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15104;
        startFace       133044;
    }
)

// ************************************************************************* //
